In [1]:
import pymysql

In [2]:
import pandas as pd

In [13]:
conn=pymysql.connect(
    host='localhost',
    user='root',
    password='1111',
    db='study')

SQL="SELECT * FROM film LIMIT 1"
df=pd.read_sql(SQL, conn)

In [15]:
df

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

In [16]:
cur=conn.cursor()

In [19]:
cur.execute('SELECT * FROM avengers')
rows=cur.fetchall()
for data in rows:
    print(data)

(1, '20090101', '아이언맨', 'IDE', '01112345678', 1)
(2, '20100102', '캡틴', 'CSE', '01123435343', 4)
(10, '20110103', '헐크', 'MSE', '01121342443', 1)
(11, '20100102', '캡틴', 'CSE', '01123435343', 4)
(12, '20100204', '토르', 'ESE', '01123424343', 2)
(13, '20100204', '토르', 'ESE', '01123424343', 2)
(14, '20110106', '스파이더맨', 'IME', '01134343222', 0)
(15, '20080104', '블랙위도우', 'IDE', '01123432432', 6)
(16, '20090105', '호크아이', 'CSE', '01112342433', 8)
(17, '20090301', '스트레인지', 'ESE', '01132424244', 5)
(18, '20090302', '퀵실버', 'IDE', '01112321313', 3)
(19, '20100505', '스칼릿위치', 'CSE', '01123534644', 2)
(20, '20110506', '비전', 'MSE', '01121334525', 8)
(21, '20100507', '팔콘', 'ESE', '01123423623', 0)
(22, '20110502', '블렉펜서', 'IME', '01134332634', 1)
(23, '20080501', '타노스', 'IDE', '01123436346', 2)
(24, '20090503', '앤트맨', 'CSE', '01113634645', 3)
(25, '20090509', '윈터솔져', 'ESE', '01132427535', 0)